In [1]:
import pandas as pd
import re

In [2]:
df_raw = pd.read_csv(
    '../data/interim/job_offers.csv',
    sep=';',
    encoding='UTF-8'
)
df_raw.head()

,name,company,technology,job,location.city,location.country,salary.low,salary.high,salary.currency,salary
0,Full Stack Java Developer,Sky and Space Co,NaN,java developer,Zdalna,NaN,16000.0,18000.0,PLN,NaN
1,Java Developer,Contina Sp. z o.o.,NaN,java developer,Zdalna,NaN,7000.0,12000.0,PLN,NaN
2,Java Developer (with AWS),ASTEK Polska,NaN,java developer,Zdalna,NaN,21000.0,28350.0,PLN,NaN
3,Junior Java Developer,Softarely,NaN,java developer,Warszawa,POL,14700.0,18480.0,PLN,NaN
4,Junior Java/Groovy Developer,ProData Consult,NaN,java developer,Warszawa,POL,10080.0,16800.0,PLN,NaN

In [3]:
df = df_raw.copy()

df['name'] = df['name'].str.lower()
df['location.city'] = df['location.city'].str.lower()

In [4]:
df['salary_avg'] = (df['salary.low'] + df['salary.high'])/2

In [5]:
df['location.city'].unique()

array(['zdalna', 'warszawa', 'kraków', 'wrocław', 'warsaw', 'budapest',
       'debrecen', 'białystok', 'bydgoszcz', 'gdańsk', 'łódź', 'poznań',
       'trójmiasto', 'katowice', 'wroclaw'], dtype=object)

In [6]:
df.loc[df['location.city'].isin(['warsaw', 'warszawa']), 'location.city'] = 'warszawa'
df.loc[df['location.city'].isin(['gdańsk', 'gdansk']), 'location.city'] = 'gdańsk'
df.loc[df['location.city'].isin(['wroclaw', 'wrocław']), 'location.city'] = 'wrocław'

In [7]:
df.loc[
    (df['location.city'] == 'zdalna') &
    (df['location.country'].isnull()),
    'location.country'] = 'B/D'

In [8]:
df['is_senior'] = 0
df.loc[df['name'].apply(lambda x: True if re.match('(?i)(senior)', x) else False), 
'is_senior'] = 1

In [9]:
df = df.loc[df['salary.currency'] == 'PLN']

In [10]:
df.to_csv('../data/processed/job_offers.csv',
    sep=';',
    encoding='UTF-8',
    index=False)